txt_title = 'Здоровье'
win_x, win_y = 200, 100
win_h, win_w = 1000, 600

hello_text = 'Добро пожаловать в программу по определению состояния здоровья!'
txt_instr = ('Данное приложение позволит вам с помощью теста Руфье провести первичную диагностику вашего здоровья.\n'
                   'Проба Руфье представляет собой нагрузочный комплекс, предназначенный для оценки работоспособности сердца при физической нагрузке.\n'
                   'У испытуемого, находящегося в положении лежа на спине в течение 5 мин, определяют частоту пульса за 15 секунд;\n'
                   'затем в течение 45 секунд испытуемый выполняет 30 приседаний.\n'
                   'После окончания нагрузки испытуемый ложится, и у него вновь подсчитывается число пульсаций за первые 15 секунд,\n'
                   'а потом — за последние 15 секунд первой минуты периода восстановления.\n'
                   'Важно! Если в процессе проведения испытания вы почувствуете себя плохо (появится головокружение, шум в\n'
                   'ушах, сильная одышка и др.), то тест необходимо прервать и обратиться к врачу.' )
btn_txt = 'Начать'
name = 'Введите Ф.И.О.:'
age = 'Полных лет:'

text_1 = 'Лягте на спину и замерьте пульс за 15 секунд. Нажмите кнопку "Начать первый тест", чтобы запустить таймер.\nРезультат запишите в соответствующее поле.'
text_2 = 'Выполните 30 приседаний за 45 секунд. Для этого нажмите кнопку "Начать делать приседания",\nчтобы запустить счетчик приседаний.'
text_3 =  'Лягте на спину и замерьте пульс сначала за первые 15 секунд минуты, затем за последние 15 секунд.\nНажмите кнопку "Начать финальный тест", чтобы запустить таймер.\nЗелёным обозначены секунды, в течение которых необходимо \nпроводить измерения, черным - секунды без замера пульсаций. Результаты запишите в соответствующие поля.'
timer = '00:00:15'

btn_start = 'Начать первый тест'
start_prised = 'начать делать приседания'
final_test = 'Начать финальный тест'
results = 'Отправить результаты'

line_name = 'Ф.И.О.'
line_age = '0'
line_prised = '0'
line_final_1 = '0'
line_final_2 = '0'

final_text_1 = 'Индекс Руфье:'
final_text_2 = 'Работоспособность сердца:'